<template>
  <h2>ВОПРОСЫ-ОТВЕТЫ</h2>
  <div class="faq-item">
    <button
      class="faq-button"
      @click="
        () => (activeIndex === 1 ? (activeIndex = null) : (activeIndex = 1))
      "
      :class="{ active: activeIndex === 1 }"
    >
      Как совершить покупку на нашем интернет-магазине?
    </button>

    <div class="faq-content" :class="{ active: activeIndex === 1 }">
      <div class="faq-wrapper">
        <p>
          Для приобретения понравившегося ювелирного изделия необходимо нажать
          кнопку "Купить", далее украшение автоматически добавится в корзину.
          Когда Вы будете готовы оформить заказ, нажмите на значок корзины в
          правом верхнем углу, заполните данные и выберите способ оплаты.
        </p>
        <p>Наш менеджер свяжется с Вами, как только мы получим Ваш заказ.</p>
        <p>
          Если Вам необходима консультация, то обратитесь к менеджеру по номеру
          телефона:
          <a href="tel:+77777007333">+7 (777) 7007 333</a>
        </p>
      </div>
    </div>
  </div>
  <div class="faq-item">
    <button
      class="faq-button"
      @click="
        () => (activeIndex === 2 ? (activeIndex = null) : (activeIndex = 2))
      "
      :class="{ active: activeIndex === 2 }"
    >
      Как купить ювелирное изделие в Рассрочку
    </button>

    <div class="faq-content" :class="{ active: activeIndex === 2 }">
      <div class="faq-wrapper">
        <p>
          Для того чтобы приобрести товар в Рассрочку, необходимо иметь Credit
          card Forte Bank.
        </p>
        <p>
          Если у Вас нет Credit card Forte Bank, Вы можете подать онлайн заявку
          на регистрацию и Вам ее доставят на дом.
        </p>
      </div>
    </div>
  </div>
  <div class="faq-item">
    <button
      class="faq-button"
      @click="
        () => (activeIndex === 3 ? (activeIndex = null) : (activeIndex = 3))
      "
      :class="{ active: activeIndex === 3 }"
    >
      Система скидок
    </button>

    <div class="faq-content" :class="{ active: activeIndex === 3 }">
      <div class="faq-wrapper">
        <p>В нашем ювелирном салоне существует фиксированная система скидок:</p>
        <ul>
          <li>При покупке свыше 500 000 тенге Вы получаете скидку 10%;</li>
          <li>При покупке свыше 1 000 000 тенге Вы получаете скидку 20%;</li>
        </ul>
        <p>P.S. Скидки и акции не суммируются</p>
      </div>
    </div>
  </div>
  <div class="faq-item">
    <button
      class="faq-button"
      @click="
        () => (activeIndex === 4 ? (activeIndex = null) : (activeIndex = 4))
      "
      :class="{ active: activeIndex === 4 }"
    >
      Как произвести оплату с помощью Банковской карты?
    </button>

    <div class="faq-content" :class="{ active: activeIndex === 4 }">
      <div class="faq-wrapper">
        <ol>
          <li>
            Во время оформления товара необходимо выбрать вариант оплаты -
            "Оплата банковской картой", оплата проводится с помощью Epay Halyk.
          </li>
          <li>
            Далее необходимо запрашиваемые информационные поля ввести
            (Контактные данные, Место и время доставки, и тд.) и нажать на
            кнопку "Продолжить оформление заказа"
          </li>
          <li>
            После заполнения всех необходимых полей, Вы увидите сообщение -
            "Перейти к оплате товара"
          </li>
          <li>
            Далее система приема оплаты автоматически переведет Вас на страницу
            онлайн-оплаты банка. Заполните все необходимые данные согласно
            запрашиваемым инструкциям.
          </li>
        </ol>
      </div>
    </div>
  </div>
  <div class="faq-item">
    <button
      class="faq-button"
      @click="
        () => (activeIndex === 5 ? (activeIndex = null) : (activeIndex = 5))
      "
      :class="{ active: activeIndex === 5 }"
    >
      Доставка и оплата
    </button>

    <div class="faq-content" :class="{ active: activeIndex === 5 }">
      <div class="faq-wrapper">
        <p>
          При выборе доставки из нашего интернет-магазина Favory заказ будет
          доставлен курьерской компанией. В день доставки курьер свяжется с вами
          за 1 час до приезда. Доставка до двери по Казахстану занимает от трех
          дней.
        </p>
      </div>
    </div>
  </div>
  <div class="faq-item">
    <button
      class="faq-button"
      @click="
        () => (activeIndex === 6 ? (activeIndex = null) : (activeIndex = 6))
      "
      :class="{ active: activeIndex === 6 }"
    >
      Гарантия на ювелирные изделия Favory, Roberto Bravo
    </button>

    <div class="faq-content medium" :class="{ active: activeIndex === 6 }">
      <div class="faq-wrapper">
        <p>
          Наша компания гарантирует длительную эксплуатацию ювелирных изделий
          при надлежащим соблюдении потребителем условий эксплуатации и
          хранения. На все наши ювелирные изделия установлен гарантийный срок на
          производственный брак 12 месяцев, со дня их продажи. Условием
          выполнения гарантийных обязательств является фискальный чек.
          Пожалуйста, сохраняйте его. Гарантия не распространяется на случаи
          повреждения ювелирного изделия в результате необеспечения надлежащих
          условий эксплуатации и хранения ювелирного изделия потребителем, а
          также не распространяется на преждевременный износ покрытия.
        </p>
      </div>
    </div>
  </div>
  <div class="faq-item">
    <button
      class="faq-button"
      @click="
        () => (activeIndex === 7 ? (activeIndex = null) : (activeIndex = 7))
      "
      :class="{ active: activeIndex === 7 }"
    >
      Возврат ювелирного украшения
    </button>

    <div class="faq-content big" :class="{ active: activeIndex === 7 }">
      <div class="faq-wrapper">
        <p>
          Наша компания как Продавец предоставляет гарантию на товар, срок
          которой составляет 12 месяцев от даты приобретения товара
          Потребителем. Потребитель вправе в течение 14 календарных дней с
          момента приобретения, обменять купленный товар надлежащего качества на
          аналогичный товар другого размера, формы, габарита, фасона, расцветки,
          комплектации, имеющийся у Продавца, произведя, в случае разницы в
          цене, необходимый перерасчет с Продавцом. Обмен/возврат товара
          надлежащего качества возможен в случае, если товар не был в
          употреблении, сохранен его товарный вид, в том числе и упаковка,
          пломбы, ярлыки (бирки) не отделены (не срезаны) от товара, сохранены
          потребительские свойства, а также документ, подтверждающий факт
          приобретения товара (контрольный или товарный чек). Товар надлежащего
          качества с отделенной от него пломбой, ярлыком (биркой), в
          соответствии со ст. 30 Закона Республики Казахстан «О защите прав
          потребителей» № 274-IV от 04.05.2010 года, обмену (возврату) не
          подлежит. Обмен/возврат товара надлежащего качества осуществляется
          Продавцом не позднее чем через 30 календарных дней с момента получения
          от Потребителя товара и пакета необходимых документов. В случае
          обнаружения Потребителем недостатков товара и предъявления им
          требования о его замене, а также экспертного подтверждения
          производственного дефекта товара, Продавец обязан заменить его в
          течение 30 календарных дней с момента предъявления соответствующего
          требования. Перед осуществлением обмена (возврата) товара,
          надлежащего/ненадлежащего качества Продавец оставляет за собой право
          произвести экспертизу изделия. Независимая экспертиза товара,
          подлежащего обмену (возврату) осуществляется исключительно в филиалах
          «Пробирная палата» АО «НАЦЭКС». Расходы по экспертизе товара
          надлежащего качества несет Потребитель. Продавец вправе удержать из
          стоимости подлежащего возврату товара, сумму за осуществленную
          экспертизу. В случае подтверждения недостатка/дефекта товара, расходы
          по экспертизе товара оплачивает Продавец, а в противном случае –
          Потребитель. Подарочный сертификат возврату и обмену на подарочный
          сертификат такого же или другого номинала не подлежит.
        </p>
      </div>
    </div>
  </div>
  <div class="faq-item">
    <button
      class="faq-button"
      @click="
        () => (activeIndex === 8 ? (activeIndex = null) : (activeIndex = 8))
      "
      :class="{ active: activeIndex === 8 }"
    >
      Почему нам можно доверять
    </button>

    <div class="faq-content big" :class="{ active: activeIndex === 8 }">
      <div class="faq-wrapper">
        <ol>
          <li>
            Безукоризненное качество. Если драгоценные камни, то только с
            сертификацией качества. Если золото, то самых наивысших проб. Все
            наши изделия проходят дополнительный контроль качества, чтобы
            радовать Вас всю жизнь.
          </li>
          <li>
            Желание клиента – закон. Мы обещаем: никакого давления, никаких
            назойливых звонков. Задавайте нам любые вопросы. Думайте так долго,
            как вам нужно. Каждому клиенту при первом обращении предлагается
            личный менеджер, который всегда доступен для связи и готов помочь
            найти идеальное украшение по идеальной цене.
          </li>
          <li>
            Не платите больше, чем это стоит. Мы всегда стараемся предложить
            наилучшие цены на ювелирные украшения, которые продаем.
          </li>
          <li>
            Никаких подделок. Наш ювелирный салон работает только с известными и
            проверенными заводами, которые уже давно на рынке и к которым не
            было нареканий по качеству.
          </li>
          <li>
            Мы уже позаботились обо всех деталях. Каждый заказ, оформленный на
            нашем сайте, доставляется по всей Алмате бесплатно, курьером.
            Доставка по Казахстану осуществляется курьерской службой СДЕК. К
            каждому изделию прилагается товарный чек. Каждое изделие проходит
            Пробирную палату.
          </li>
          <li>
            Честная гарантия. Можете вздохнуть спокойно, мы стеной стоим за
            качеством наших ювелирных изделий. От Вас требуется только сохранить
            сертификат и чек от украшения, и если с ним что-то случится, мы
            обязательно заменим бракованное изделие у поставщика или организуем
            ремонт у лучшего мастера.
          </li>
        </ol>
      </div>
    </div>
  </div>
</template>
<script setup>
import { ref } from 'vue';

let activeIndex = ref(null);
</script>
<style scoped>
.faq-item {
  padding: 0;
}
.faq-item div {
  padding: 0;
}
.faq-button {
  width: 100%;
  /* margin-top: 20px; */
  display: block;
  padding: 10px 40px 10px 10px;
  text-align: left;
  background-color: #f5f5f5;
  border-color: #ddd;
  box-shadow: none;
  position: relative;
  border: none;
  /* border-radius: 5px; */
  /* box-shadow: 0 0 10px 0px rgba(0, 0, 0, .5); */
  &::after {
    content: '';
    position: absolute;
    top: 50%;
    right: 15px;
    transform: translateY(-55%) rotate(45deg);
    border: solid black;
    border-width: 0 2px 2px 0;
    display: inline-block;
    padding: 4px;
    transition: all .5s;
  }
}
.faq-item:first-child{
  /* border-radius: 5px 5px 0 0; */
}
.faq-button.active::after{
    transform: translateY(-55%) rotate(-135deg);

}
div.faq-wrapper {
  border: 1px solid #ccc;
  border-top: none;
  padding: 10px 10px 10px;
  /* transform: translateY(-10px); */
}
div.faq-content {
  transition: all 0.5s;
  max-height: 0;
  overflow: hidden;
}
.faq-content.active {
  max-height: 570px;
}
.faq-content.active.medium {
  max-height: 1000px;
}
.faq-content.active.big {
  max-height: 2000px;
}
</style>
