<template>
  <h2>ХРАНЕНИЕ И УХОД</h2>
  <h3>Хранение</h3>
  <p>
    Золотые изделия желательно хранить только в мягких футлярах. Такой вариант
    подойдет, если у вас всего парочка таких драгоценностей. В ином случае
    потребуется приобретать коробочки разного цвета и формы либо специальную
    шкатулку. Важно помнить о том, что драгоценность высокой пробы довольно
    мягкая и может испортиться, если она лежит вместе в другими украшениями.
    Откажитесь от картонных или бумажных упаковок – в них содержится сера, она
    плохо влияет на золото и могут появиться нежелательные пятна.
  </p>
  <p>
    <u
      >*Все ювелирные изделия, приобретаемые в нашем салоне качественно
      упакованы в специальные коробочки.
    </u>
  </p>
  <br>
  <br>
  <h3>Уход</h3>
  <p>
    Как ухаживать за белым золотом: стоит протирать почаще тканью из фланели,
    замши или микрофибры после использования. Если загрязнение не сильное, можно
    сделать раствор с жидким мылом и добавить туда несколько капель нашатырного
    спирта – не более 10 на стакан. После того, как кольцо или ожерелье было
    тщательно обработано этим раствором, его промывают обычной, проточной водой
    и оставляют сушиться.
  </p>
  <p>
    В трудных случаях потемнения смешайте средство для мытья посуды с водой,
    поместите туда изделие и оставьте на сутки. Перед данной процедурой
    внимательно изучите состав вещества, чтобы в нем не оказалось губительного
    для золота компонента.
  </p>
  <p>
    Важно не допускать контакта изделия с веществом с высоким содержанием соли и
    хлора.
  </p>
  <ul>
    <li>
      Золото плохо переносит контакт с щелочными моющими средствами. Прежде чем
      ими пользоваться даже в перчатках, кольца следует снять.
    </li>
    <li>
      На любой драгоценности могут появиться пятна от химических, лекарственных,
      парфюмерных или косметических средств. Убрать эти потемнения будет очень
      сложно.
    </li>
    <li>
      Минимум раз год,
      <u
        >Вы можете отправить ювелирное изделия в наш салон на профессиональную
        чистку, и мы вернем Вашему изделию первозданный вид.</u
      >
    </li>
  </ul>
</template>
