<template>
  <h2>ДОСТАВКА И ОПЛАТА</h2>
  <p>
    Для обеспечения приятного и комфортного шоппинга в нашем интернет-магазине
    действует самая оперативная доставка по всем регионам Казахстана.
  </p>
  <br />
  <p>
    *Пожалуйста убедитесь, что можете принять заказ до 20:00. В другом случае
    доставка будет осуществлена на следующий день.
  </p>
  <br />
  <br />
  <h3>Способы доставки</h3>
  <div>
    <p>CDEK</p>
  </div>
  <br />
  <br />
  <h3>Доставка по Алматы</h3>
  <div>
    <p>
      Доставка осуществляется от двери до двери по указанному в заказе адресу;
    </p>
    <p>Доставка осуществляется в течение 1-2 рабочих дней.</p>
  </div>
  <br />
  <br />
  <h3>Доставка по Казахстану</h3>
  <div>
    <p>
      Экспресс-доставка осуществляется от двери до двери по указанному в заказе
      адресу;
    </p>
    <p>3-5 рабочих дня в зависимости от региона.</p>
  </div>
  <br />
  <br />
  <h3>Способы оплаты</h3>
  <h3>Онлайн оплата банковской картой через систему ePay.</h3>
  <div>
    <p>
      Вы можете оплатить свой заказ в нашем интернет-магазине любой банковской
      платежной картой Visa и MasterCard, выпущенных в любом банке.
    </p>
    <p>
      Для этого при оформлении заказа выберите вариант оплаты Epay Halyk: О
      безопасности онлайн платежной системы Epay Вы можете прочитать на
      <a href="http://epay.kkb.kz/security">http://epay.kkb.kz/security</a>
    </p>
    <br />
  </div>
  <h3>Рассрочка</h3>
  <div>
    <h4><u> Если у Вас есть Credit card Forte Bank: </u></h4>
    <ol>
      <li>Заполняете платежные данные.</li>
      <li>Выбираете способ оплаты "Рассрочка".</li>
      <li>Ознакомившись с разделами "Возврат/Гарантия", подтверждаете их.</li>
      <li>Нажимаете кнопку "Подтверждение заказа".</li>
      <li>
        После Вас перенаправляет на платежный шлюз, где Вы заполняете данные.
      </li>
      <li>Далее Вам звонит менеджер, подтверждая Ваш заказ.</li>
    </ol>
    <h4><u> Если у Вас нет Credit card Forte Bank: </u></h4>
    <ol>
      <li>
        Регистрируете Credit card Forte Bank по следующей ссылке Credit card
        Forte Bank
      </li>
      <li>Заполняете платежные данные.</li>
      <li>Выбираете способ оплаты "Рассрочка".</li>
      <li>Ознакомившись с разделами "Возврат/Гарантия", подтверждаете их.</li>
      <li>Нажимаете кнопку "Подтверждение заказа".</li>
      <li>
        После Вас перенаправляет на платежный шлюз, где Вы заполняете данные.
      </li>
      <li>Далее Вам звонит менеджер, подтверждая Ваш заказ.</li>
    </ol>
  </div>
</template>
