<script setup>
import Header from '../components/Header.vue';
import Footer from '../components/Footer.vue';
</script>

<template>
    <Header />
    <section class="info-page">
        <h2>О КОМПАНИИ</h2>
        <p>
            Салон ярких ювелирных изделий Favory - работает с 2001 года и по сей день
            радует своих клиентов великолепными по своей красоте, роскоши и качеству
            ювелирными украшениями. Наши ювелирные изделия всегда отвечают мировым
            стандартам качества ювелирного производства делая тщательнейшую отборку
            наших изделий, а одним из главных критериев нашего салона является
            эксклюзивность моделей.
        </p>
        <p>
            В нашем салоне представлены украшения от самых известных ювелирных
            производителей с многолетними традициями и историей. Благодаря высоким
            технологиями, профессионализму ручной работы и широкому спектру изделий, наш
            салон всегда пользуется доверием и спросом среди настоящих ценителей
            изысканной ювелирной красоты.
        </p>
        <p>
            Художники и дизайнеры известных ювелирных производителей создают уникальные
            и роскошные украшения, которые отличаются своей яркостью, изяществом и
            индивидуальностью. Все представленные в нашем салоне модели изготавливаются
            в единичном варианте или выпускаются ограниченной партией.
        </p>
        <p>Поэтому еще ни один клиент не ушел от нас недовольным!</p>
    </section>
    <Footer />
</template>