<script setup>
import Header from '../components/Header.vue';
import Footer from '../components/Footer.vue';
</script>
<template>
    <Header />
    <section class="info-page">
        <h2>ТАБЛИЦА РАЗМЕРОВ</h2>
        <h3>Кольца</h3>
        <p>
            Подбор точного размера кольца – важная часть при покупке ювелирного изделия.
            Нам важно, чтобы Вы чувствовали комфорт уже с первой примерки украшения.
        </p>
        <p>
            Чтобы определить Ваш размер, обмерьте палец с помощью сантиметровой ленты.
            Соотнесите полученные параметры с размерной таблицей.
        </p>
        <table>
            <tr>
                <th>Диаметр, мм</th>
                <th>Казахстан, Россия</th>
            </tr>
            <tbody>
                <tr>
                    <td>
                        <p>14,8</p>
                    </td>
                    <td>
                        <p>15</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>15,3</p>
                    </td>
                    <td>
                        <p>15,5</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>15,7</p>
                    </td>
                    <td>
                        <p>15,75</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>15,9</p>
                    </td>
                    <td>
                        <p>16</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>16,1</p>
                    </td>
                    <td>
                        <p>16</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>16,3</p>
                    </td>
                    <td>
                        <p>16,3</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>16,5</p>
                    </td>
                    <td>
                        <p>16,5</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>16,7</p>
                    </td>
                    <td>
                        <p>16,6</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>16,9</p>
                    </td>
                    <td>
                        <p>17</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>17,1</p>
                    </td>
                    <td>
                        <p>17,1</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>17,5</p>
                    </td>
                    <td>
                        <p>17,5</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>17,9</p>
                    </td>
                    <td>
                        <p>17,8</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>18,2</p>
                    </td>
                    <td>
                        <p>18</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>18,5</p>
                    </td>
                    <td>
                        <p>18,5</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>18,9</p>
                    </td>
                    <td>
                        <p>19</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>19,5</p>
                    </td>
                    <td>
                        <p>19,5</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>19,8</p>
                    </td>
                    <td>
                        <p>20</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>20,2</p>
                    </td>
                    <td>
                        <p>20,3</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>20,7</p>
                    </td>
                    <td>
                        <p>20,7</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>21</p>
                    </td>
                    <td>
                        <p>21<b></b></p>
                    </td>
                </tr>
            </tbody>
        </table>
        <h3>Браслеты</h3>
        <p>
            Перед тем, как приобрести браслет на руку, нужно узнать его размер.
            Правильно подобрать размер браслета на женскую руку поможет размерная
            таблица. Выбирать нужно так, чтобы браслет не соскальзывал с руки или не
            давил на нее.
        </p>
        <div class="table-scroll">
            <table>
                <tr>
                    <th>Казахстан, Россия</th>
                    <th>Международный размер</th>
                    <th>Обхват запястья, см</th>
                    <th>Обхват запястья, дюймы</th>
                </tr>
                <tr>
                    <td>
                        <p>1</p>
                    </td>
                    <td>
                        <p>XS</p>
                    </td>
                    <td>
                        <p>от 16.5 до 17.7</p>
                    </td>
                    <td>
                        <p>6.5</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>2</p>
                    </td>
                    <td>
                        <p>S</p>
                    </td>
                    <td>
                        <p>от 17.8 до 19</p>
                    </td>
                    <td>
                        <p>7</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>3</p>
                    </td>
                    <td>
                        <p>M</p>
                    </td>
                    <td>
                        <p>от 19 до 20.3</p>
                    </td>
                    <td>
                        <p>7.5</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>4</p>
                    </td>
                    <td>
                        <p>L</p>
                    </td>
                    <td>
                        <p>от 20.4 до 21.7</p>
                    </td>
                    <td>
                        <p>8</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>5</p>
                    </td>
                    <td>
                        <p>XL</p>
                    </td>
                    <td>
                        <p>от 21.8 до 23</p>
                    </td>
                    <td>
                        <p>9</p>
                    </td>
                </tr>
            </table>
        </div>
        <h3>Цепи</h3>
        <p>
            Цепочки являются популярным украшением среди женщин. При покупке, стоит
            обратить внимание на тип плетения, толщину и длину изделия.
        </p>
        <p>
            Различные размеры цепей предназначены для создания определенного образа,
            правильно подобранная длина цепочки позволяет чувствовать себя комфортно и
            уверенно.
        </p>
    </section>
    <Footer />
</template>
  