<script setup>
import Header from '../components/Header.vue';
import Footer from '../components/Footer.vue';
</script>
<template>
    <Header />
    <section class="info-page">
        <h2>ВОЗВРАТ / ГАРАНТИЯ</h2>
        <p>
            Каждое ювелирное изделие Favory проходит полную государственную инспекцию в
            «Пробирной палате» АО «НАЦЭКС», что включает в себя проверку на подлинность,
            как самого изделия, так и его составляющих (камни, металл), взвешивание,
            клеймение, выдачу экспертного заключения. Все наши изделия обязательно
            проходят процедуру растаможивания согласно законодательству РК, Вы всегда
            можете удостовериться в подлинности Вашего украшения, обратившись в
            «Пробирную палату» по адресу: 050000, г. Алматы, пр. Назарбаева, 161.
        </p>
        <p>
            Продавец предоставляет гарантию на товар, срок которой составляет 12 месяцев
            от даты приобретения товара Потребителем. Потребитель вправе в течение 14
            календарных дней с момента приобретения, обменять купленный товар
            надлежащего качества на аналогичный товар другого размера, формы, габарита,
            фасона, расцветки, комплектации, имеющийся у Продавца, произведя, в случае
            разницы в цене, необходимый перерасчет с Продавцом.
        </p>
        <p>
            Обмен/возврат товара надлежащего качества возможен в случае, если товар не
            был в употреблении, сохранен его товарный вид, в том числе и упаковка,
            пломбы, ярлыки (бирки) не отделены (не срезаны) от товара, сохранены
            потребительские свойства, а также документ, подтверждающий факт приобретения
            товара (контрольный или товарный чек).
        </p>
        <p>
            Товар надлежащего качества с отделенной от него пломбой, ярлыком (биркой), в
            соответствии со ст. 30 Закона Республики Казахстан «О защите прав
            потребителей» № 274-IV от 04.05.2010 года, обмену (возврату) не подлежит.
        </p>
        <p>
            Обмен/возврат товара надлежащего качества осуществляется Продавцом не
            позднее чем через 30 календарных дней с момента получения от Потребителя
            товара и пакета необходимых документов. В случае обнаружения Потребителем
            недостатков товара и предъявления им требования о его замене, а также
            экспертного подтверждения производственного дефекта товара, Продавец обязан
            заменить его в течение 30 календарных дней с момента предъявления
            соответствующего требования.
        </p>
        <p>
            Перед осуществлением обмена (возврата) товара, надлежащего/ненадлежащего
            качества Продавец оставляет за собой право произвести экспертизу изделия.
            Независимая экспертиза товара, подлежащего обмену (возврату), осуществляется
            исключительно в филиалах «Пробирная палата» АО «НАЦЭКС». Расходы по
            экспертизе товара надлежащего качества несет Потребитель. Продавец вправе
            удержать из стоимости подлежащего возврату товара, сумму за осуществленную
            экспертизу. В случае подтверждения недостатка/дефекта товара, расходы по
            экспертизе товара оплачивает Продавец, а в противном случае – Потребитель.
        </p>
        <p>
            Мы гарантируем длительную эксплуатацию изделий при соблюдении потребителем
            условий эксплуатации и хранения.
        </p>
        <p>
            Произведя оплату за приобретаемые изделия «Favory» в нашем
            интернет-магазине, вы соглашаетесь с условиями гарантии, хранения,
            эксплуатации ювелирных изделий и рекомендациями по уходу за ними,
            изложенными в сертификате подлинности.
        </p>
        <p>
            Гарантия не распространяется на случаи повреждения ювелирного изделия в
            результате необеспечения надлежащих условий эксплуатации и хранения
            ювелирного изделия потребителем.
        </p>
    </section>
    <Footer />
</template>
  